Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །འཇིག་རྟེན་དགའ་མཛད་བློ་བཟང་མཐོང་།
en: The Muni Sumanas, who pleased the world,

source: །འཁོར་ནི་སྟོང་དང་རབ་ཏུ་བྱུང་།
en: And went forth with a thousand attendants.

source: །སངས་རྒྱས་ཙན་དན་འོད་དཔག་མེད།
en: I offered the Buddha Candana, Whose radiance gave off immeasurable splendor,

source: །ཆུ་འཇམ་དང་ནི་ཏིལ་མར་དང་། །བུ་རམ་ལ་ནི་སྤྱན་དྲངས་སོ།
en: Soft water, oil, and guḍa.

source: །ཀུན་དགའ་རྒྱལ་པོར་གྱུར་པ་ན།
en: “Ānanda, when I was a king

source: །ཚངས་སྦྱིན་གྲགས་པ་ཆེན་པོ་པ།
en: I venerated the Leader Brahmadatta, Who possessed great fame,

source: །འདྲེན་པ་ལ་ནི་ཞལ་ཟས་དང་། །ཐམས་ཅད་སྦྱིན་པས་མཆོད་པ་བྱས།
en: With meals and every kind of donation.

source: །བྲམ་ཟེར་ཡང་ནི་གྱུར་པ་ན།
en: “Again, when I was a brahmin,

source: །ཐུགས་རྗེ་ཆེན་པོ་འོད་ཟེར་ཅན།
en: I saw Marīcin, who was of great mercy,

source: །ཐུབ་པ་རྐང་གཉིས་མཆོག་མཐོང་ནས།
en: The Muni, the best of humans,

source: །སྨྲ་བའི་རྒྱལ་མཚན་གྱིས་མཆོད་དོ།
en: And venerated him with a banner of praise.

source: །རྒྱལ་པོར་གྱུར་ནས་སངས་རྒྱས་ནི།
en: “As a king, I venerated the Buddha Parārthadarśin,

source: །དོན་དམ་གཟིགས་པ་གྲོང་མཆོག་ཏུ། །འཇུག་པ་དེ་ལ་ཏ་ལ་ཡི།
en: Who had entered my most excellent city,

source: །ལོ་མའི་བསིལ་ཡབ་མཆོད་པ་བྱས།
en: With a fan made from palm leaves.

source: །འཇིག་རྟེན་གསལ་མཛད་སངས་རྒྱས་ནི། །ཤཱཀྱ་ཐུབ་ལ་མེ་ཏོག་གི།
en: The buddha shining on the world,

source: །སིལ་མ་སྣ་ཚོགས་དྲི་སྦྱར་མཆོད།
en: With various fragrant flower petals. “When I saw the best of humans,

source: །གྲོང་ཁྱེར་མཆོག་ཏུ་མཐོར་འཕགས་པའི།
en: Atyuccagāmin, enter the most excellent city,

source: །མི་མཆོག་འཇུག་པར་མཐོང་ནས་ནི།
en: I venerated him

source: །རོལ་མོ་རྣམས་ཀྱི་སྒྲ་དག་དང་། །མེ་ཏོག་རྣམས་ཀྱིས་མཆོད་པ་བྱས།
en: With various kinds of music and flowers.

source: །རྒྱལ་པོར་གྱུར་ཚེ་དད་པ་ཡིས།
en: “When I was a king, out of faith I offered a chariot for the first time

source: །སངས་རྒྱས་དམ་པ་ཞེས་བྱ་བ།
en: To a buddha named Uttara,

source: །སྲིད་པའི་མཚོ་ལས་རྒལ་བ་ལ། །ཐོག་མར་ཤིང་རྟ་དག་གིས་བསྟབས།
en: Who had crossed the ocean of existence.

source: །ང་ནི་རྒྱལ་པོར་གྱུར་པ་ན། །གཙོ་བོའི་ཆེད་དུ་ལམ་བསྟན་ཅིང་།
en: “When I was a king,

source: །དཔག་ཚད་བརྒྱ་ནི་གང་བར་ཡང་།
en: I cleaned the streets for Śreṣṭhin,

source: །མེ་ཏོག་ཁང་བརྩེགས་མཆོད་པ་བྱས།
en: And venerated him by building flower pavilions One hundred yojanas in circumference.

source: །སངས་རྒྱས་དགྲ་ཞི་མཛད་པ་ནི།
en: “When I heard that the Buddha Śamitāri

source: །གྲོང་ཁྱེར་གཤེགས་ཞེས་ངས་ཐོས་ནས།
en: Had come to the city,

source: །ལམ་ནི་རྒྱལ་མཚན་ཡོངས་བཀང་སྟེ།
en: I filled the streets with flags

source: །རྒྱལ་པོའི་འབྱོར་པས་བསུ་བ་བྱས།
en: And welcomed him with royal majesty.

source: །ང་ནི་མཉན་པར་གྱུར་པ་ན། །ཤིང་རྟའི་ཡན་ལག་ཆུ་འགྲམ་དུ།
en: “When I was a ferryman,

source: །བྱོན་པ་ངས་ནི་མཐོང་ནས་ནི།
en: I saw Aṅgaratha arrive at the bank

source: །ཐུབ་པ་ཆུ་ཡི་རྒྱུན་ལས་བསྒྲལ།
en: And helped the Muni Cross the water’s current.

source: །དེད་དཔོན་གྱུར་ཚེ་དད་པ་ཡིས།
en: “When I was a caravan leader, Out of faith I formed boats in a line

source: །ཤིང་རྟ་སྐལ་ལྡན་ཆེན་པོ་ནི།
en: For Mahābhāgīratha, and helped him

source: །ངས་ནི་གྲུ་ཟམ་བཏགས་ནས་ཀྱང་། །མཚོ་ཆེན་ལས་ནི་བསྒྲལ་བ་བྱས།
en: Cross the great ocean.

source: །རྐང་གཉིས་དམ་པ་སངས་རྒྱས་ནི།
en: I venerated the excellent human,

source: །ཚངས་ལ་ཙན་དན་ས་མཆོག་གི།
en: The Buddha Brahmā, with a building

source: །ཀ་བར་ལྡན་པའི་ཁང་པས་མཆོད།
en: Whose pillars were made of gośīrṣacandana.

source: །རྒྱལ་པོར་གྱུར་ཚེ་སངས་རྒྱས་ནི།
en: “When I was a king, venerating

source: །བཅོམ་ལྡན་ཚངས་པའི་ཚེ་མཆོད་ཅིང་།
en: The Buddha, the Blessed One Brahmāyus,

source: །སྣམ་སྦྱར་རྒྱལ་མཚན་བསྒྲེང་ནས་ནི།
en: I raised an outer robe and a flag

source: །ངས་ནི་ཡམས་ཀྱི་ནད་ཞི་བྱས།
en: And caused epidemics to cease.

source: །ཙན་དན་ལྡན་ལ་ཆར་མེད་ཚེ།
en: “At the time of a drought,

source: །རྒྱལ་པོ་ལྟ་བུའི་སྐུ་ཁྲུས་བྱས།
en: I offered Candana a royal bath.

source: །དེ་ཚེ་ལྷས་ནི་ཆར་ཕབ་པས།
en: Then the gods brought rain,

source: །སྐྱེ་བོ་རྣམས་ནི་སྐྱབས་སུ་དོང་།
en: And the people were saved.

source: །སངས་རྒྱས་བཅོམ་ལྡན་ཟླ་བ་ལ།
en: I venerated the Buddha, the Blessed One Candra.

source: །མཆོད་ནས་ངས་ནི་བྱམས་བསྒོམས་པས།
en: I cultivated love

source: །བདུད་ཀྱིས་བཏང་བའི་ཡམས་ནད་ཞི།
en: And quelled an epidemic sent by Māra.

source: །མི་ཡི་དབང་པོར་སྔོན་གྱུར་ཚེ།
en: “Once when I was the master of the people,

source: །སངས་རྒྱས་དབང་པོ་འདུལ་བ་ལ།
en: I begged the Buddha Indradamana

source: །ཆོ་འཕྲུལ་ཕྱིར་ནི་གསོལ་བ་བཏབ།
en: For a miracle.

source: །རྒྱལ་པོ་དག་ཏུ་གྱུར་པ་ན།
en: “When I was a king,

source: །རིན་ཆེན་རི་བོ་འོད་ཆེན་ལྡན།
en: Having seen Ratnaśaila with his radiant splendor

source: །འཁོར་ནི་བརྒྱ་སྟོང་ཕྲག་མང་པོ།
en: And his hundreds of thousands of attendants,

source: །མཐོང་ནས་ལོ་ལྔར་མཆོད་པ་བྱས།
en: I venerated him for five years.

source: །བྲམ་ཟེར་གྱུར་ཚེ་དད་པ་ཡིས།
en: “When I was a brahmin,

source: །སངས་རྒྱས་དོན་ཀུན་སྒྲུབ་པ་ནི།
en: Having seen the Buddha Sarvārtha­siddha,

source: །མཚན་དང་ལྡན་པ་མཐོང་ནས་ཀྱང་།
en: Who possessed the marks, I chanted

source: །ངས་ནི་བསྟོད་པ་ལྔ་བརྒྱ་བྱས།
en: Five hundred praises out of faith.

source: །བྲམ་ཟེར་གྱུར་ཚེ་ཡིད་དགའ་བས།
en: “When I was a brahmin,

source: །སངས་རྒྱས་དབང་པོ་རྒྱལ་མཚན་མཐོང་།
en: I saw the Buddha Indradhvaja, and my heart was pleased.

source: །ངས་ནི་ཐལ་མོ་ལེགས་སྦྱར་ཏེ།
en: I made the gesture of supplication

source: །དམ་པ་སྩོལ་བའི་འོས་ཞེས་གསོལ།
en: And said, ‘Please bestow on me what is best.’

source: །སངས་རྒྱས་མར་མེ་མཛད་པ་ནས།
en: “From the Buddha Dīpaṃkara

source: །ཐུབ་པ་དབང་པོའི་རྒྱལ་མཚན་བར།
en: To the Muni Indradhvaja, I venerated

source: །བདུན་ཁྲི་དང་ནི་དྲུག་སྟོང་གི། །སངས་རྒྱས་རྣམས་ནི་ང་ཡིས་མཆོད།
en: Seventy-six thousand buddhas.

source: །གྲངས་མེད་གཉིས་པ་ཚང་བར་ནི།
en: “Throughout the second incalculably long eon,

source: །གྲངས་མེད་པ་གཉིས་པའོ། །སངས་རྒྱས་བདེ་མཛད་དམ་པ་ལ།
en: “This encompasses the second incalculably long eon.

source: །རྒྱལ་པོར་གྱུར་ཚེ་མཆོད་བྱས་ཏེ།
en: “When I was a king, I venerated the Buddha Kṣemaṃkara, the supreme one.

source: །མྱ་ངན་འདས་ནས་མཆོད་རྟེན་བརྩིགས།
en: After his nirvāṇa, I built a stūpa

source: །རྒྱལ་སྲིད་རབ་ཏུ་ཞི་བར་བྱས།
en: And pacified the kingdom.

source: །རྒྱལ་པོར་གྱུར་ཚེ་དད་པས་ནི།
en: “When I was a king, I venerated correctly, out of faith,

source: །སངས་རྒྱས་གང་པོ་རེ་སྐོང་ལ། །ཚུལ་དང་འདྲ་བར་མཆོད་བྱས་ཏེ།
en: The Buddha Pūrṇamanoratha,

source: །ཆོས་ཀྱི་རྒྱལ་པོ་ཞེས་བསྒྲགས་སོ།
en: And I was called a Dharma king. “When I was the head of a guild,

source: །སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གནོན་ལ། །ཚོང་དཔོན་གྱུར་ཚེ་ལེགས་པར་ནི། །རིམ་གྲོ་བྱས་ཤིང་མི་མཆོག་ལ།
en: I attended the Buddha Sarvābhibhū well,

source: །དེ་བཞིན་གསེར་གྱི་མེ་ཏོག་གཏོར།
en: And scattered golden flowers For that most excellent of humans.

source: །སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན།
en: I venerated with a golden net The Buddha Ratnacūḍa,

source: །ཐུབ་ཆེན་གྲོང་མཆོག་གཤེགས་དེ་ལ།
en: The great Muni, who had come to the most excellent city. “When I was the head of a guild,

source: །གསེར་གྱི་དྲ་བས་མཆོད་པ་བྱས། །ང་ནི་ཚོང་དཔོན་གྱུར་པ་ན།
en: I scattered silver flower petals

source: །པད་མ་དམ་པ་དཔའ་ཆེན་པོ།
en: For Padmottara, who was of great courage,

source: །རྒྱལ་པོར་གྲགས་པའི་གྲོང་མཆོག་ཏུ། །དངུལ་གྱི་མེ་ཏོག་སིལ་མས་གཏོར།
en: In the most excellent city of the renowned king.

source: །ང་ནི་བྲམ་ཟེར་གྱུར་པ་ན།
en: “When I was a brahmin,

source: །སངས་རྒྱས་གྲགས་མཆོག་སློབ་མ་ཡི།
en: I saw the Buddha Yaśottara

source: །དགེ་འདུན་གྱིས་ནི་མདུན་བལྟས་པ།
en: Attended by his community of disciples,

source: །མཐོང་ནས་མི་མཆོག་གནས་ཀྱིས་མཆོད།
en: And venerated that most excellent of humans with a residence.

source: །ལེགས་གསུང་བྱང་ཆུབ་ཤིང་དྲུང་དུ། །བཞུགས་པ་ངས་མཐོང་གླང་པོ་རྟ།
en: I saw Suvādin sitting under the Bodhi tree

source: །ཤིང་རྟ་དཔུང་བུ་ཆུང་གིས་བསྲུངས།
en: And protected him with elephants, horses, Chariots, and infantry. “When I was the head of a guild,

source: །སངས་རྒྱས་དྲི་མེད་ཐུབ་ཆེན་ལ།
en: I venerated the Buddha Vimala, the great Muni, Building a steam bath

source: །ཚོང་དཔོན་གྱུར་ཚེ་བསྲོ་གང་དང་། །མཆོད་རྟེན་ལས་དང་མར་མེས་ནི།
en: And a stūpa, and offering lamps.

source: །དེ་ཡི་ཚེ་ན་རྣམ་པར་མཆོད།
en: “When I saw the Buddha Prabodhana

source: །སངས་རྒྱས་སད་མཛད་རྡོ་ལེབ་སྟེང་།
en: Meditating on a slate,

source: །སྙོམས་པར་ཞུགས་པ་མཐོང་ནས་ནི།
en: I offered out of faith

source: །དད་པས་རོལ་མོའི་སྒྲ་ཀུན་དང་། །རྒྱལ་པོའི་འབྱོར་པས་བཞེངས་གསོལ་ཏོ།
en: Music and royal treasures.

source: །འཇིག་རྟེན་དགའ་མཛད་དགྲ་ཐུལ་ལ།
en: Jitāri, who pleased the world,

source: །སངས་རྒྱས་སྤྱོད་པས་གཤེགས་པ་ན།
en: Was traveling—performing the acts of a buddha.

source: །ལམ་ནི་སྣ་ཚོགས་བརྒྱན་པས་མཆོད།
en: I venerated him, adorning the streets in various ways. “When I was the head of a guild,

source: །ཚོང་དཔོན་གྱུར་ཚེ་ཡིད་དགའ་བས། །གནས་འཇོག་གཤེགས་པ་ཐོས་ནས་ནི།
en: Pleased when I heard that Vāsiṣṭha was coming,

source: །སྐྱེད་མོས་ཚལ་ནི་བརྒྱན་བྱས་ནས།
en: I adorned a park

source: །ངས་ནི་གཙུག་ལག་ཁང་བརྩིགས་སོ། །སངས་རྒྱས་བཅོམ་ལྡན་སྐར་འོད་ལ།
en: And built a monastery.

source: །བྱང་ཆུབ་འདོད་པས་དད་པས་ངས།
en: “Seeking awakening, out of faith, I venerated the Buddha, the Blessed One Jyotis,

source: །རྒྱལ་པོའི་མཛོད་ནི་ཐམས་ཅད་ནས། །ནོར་བུ་རིན་ཆེན་རྣམས་ཀྱིས་མཆོད།
en: With the jewels Kept in all the treasuries of the king.

source: །ང་ནི་རྒྱལ་པོར་གྱུར་པའི་ཚེ།
en: “When I was a king, I raised a flag

source: །ཏོག་གིས་བདུད་རྣམས་བཅོམ་ནས་ནི།
en: For Ketu, who conquered māras

source: །ཆོས་ཀྱི་རྒྱལ་སྲིད་བསྒྲགས་པ་ན། །ངས་ནི་རྒྱལ་མཚན་ཁོ་ན་བཙུགས།
en: And was called a Dharma king.

source: །བྷ་ར་དྭ་ཛ་བློ་ལྡན་པ།
en: “To Bhāradvāja, the intelligent,

source: །བྲམ་ཟེ་མྱ་ངན་འདས་པ་ལ།
en: Emancipated one, a brahmin,

source: །རྒྱལ་པོ་ངས་ནི་རིལ་བ་དང་། །དབྱུག་གུ་གཙུག་ལག་ཁང་ཆེན་བྱས།
en: As a king I offered a water jar and staff And built a great monastery.

source: །སངས་རྒྱས་འདྲེན་པ་དོན་གཟིགས་པ།
en: I venerated the Buddha, the Leader Arthadarśin,

source: །གསེར་དང་ནོར་བུ་མུ་ཏིག་དང་། །དྲི་ཡི་སྙིང་པོ་རྣམས་ཀྱིས་མཆོད།
en: With gold, jewels, pearls, And fragrant pieces of wood.

source: །རྒྱལ་པོར་གྱུར་ཚེ་དཔུང་དག་གི།
en: I, who was a king,

source: །ཚོགས་ཀུན་གྱིས་ནི་མཆོད་པ་བྱས།
en: Venerated him with my whole army.

source: །སངས་རྒྱས་དོན་དམ་གཟིགས་པ་ནི།
en: “When the Buddha Parārthadarśin

source: །གྲོང་ཁྱེར་དམ་པར་གཤེགས་པ་ན།
en: Came to my excellent city,

source: །རྒྱལ་པོར་གྱུར་ཚེ་རོལ་མོ་དང་། །མེ་ཏོག་ཀུན་གྱིས་མཆོད་པ་བྱས།
en: I, who was a king, Venerated him with music and every flower.

source: །སངས་རྒྱས་སྐར་རྒྱལ་རྐང་གཉིས་མཆོག །དྲི་ཡི་སྙིང་པོ་དེ་བཞིན་དུ།
en: For the Buddha Tiṣya, the most excellent of humans,

source: །རྩ་བའི་དྲི་རྣམས་རབ་ཏུ་གཏོར།
en: I scattered fragrant pieces of wood And various perfumes made from roots. “I chanted a verse

source: །རིན་ཆེན་བཀྲ་བའི་ཕུག་ན་ཡང་།
en: In a radiant cave of jewels

source: །སངས་རྒྱས་སྐར་རྒྱལ་ལ་ནི་ངས། །དེ་ཚེ་ཚིགས་བཅད་གཅིག་བསྟོད་པས།
en: For the Buddha Tiṣya.

source: །བསྐལ་པ་དགུ་ནི་ཕྱིར་བསྙིལ་ཏོ།
en: Thus I reduced my lives by nine eons.

source: །འབྲུ་འཚོང་དུ་ནི་གྱུར་པ་ན།
en: “When I was a grain dealer,

source: །སངས་རྒྱས་བཅོམ་ལྡན་རྣམ་གཟིགས་ལ།
en: I venerated the Buddha, the Blessed One Vipaśyin, With a handful of mudga beans,

source: །དེ་ཚེ་བྱང་ཆུབ་སྤྱོད་པའི་ཕྱིར། །མུད་ག་སྤར་གང་ཕུལ་བས་མཆོད།
en: Practicing for awakening.

source: །ཚོང་དཔོན་གྱུར་ཚེ་ངས་མཆོད་པ།
en: “When I was the head of a guild,

source: །སངས་རྒྱས་མཆོག་ནི་གཙུག་ཏོར་ཅན།
en: I venerated the supreme Buddha Śikhin.

source: །ཐུབ་པ་ཉན་ཐོས་ཚོགས་བཅས་པ།
en: I served the Muni, together with his disciples,

source: །ཞལ་ཟས་ཀྱིས་ནི་ཟླ་གསུམ་མཆོད།
en: With meals for three months.

source: །ཚོང་དཔོན་དུ་ནི་གྱུར་པའི་ཚེ།
en: “When I was the head of a guild, I respectfully venerated with meals

source: །འཇིག་རྟེན་འདྲེན་པ་ཐམས་ཅད་སྐྱོབ། །སྐལ་ཆེན་ཉན་ཐོས་བཅས་པ་ལ།
en: The leader of the world, Viśvabhū, The one of great fortune, together with his disciples. “When I was the leader of a guild,

source: །ཞལ་ཟས་ཀྱིས་ནི་གུས་པར་མཆོད།
en: I offered all my possessions

source: །ཚོང་དཔོན་གྱུར་ཚེ་དད་པ་ཡིས། །སངས་རྒྱས་འཁོར་བ་འཇིག་པ་ནི། །བདོག་པ་ཀུན་ལ་སྤྱན་དྲངས་ནས།
en: To the Buddha Kakutsunda out of faith,

source: །ཚངས་པར་སྤྱོད་ཕྱིར་བློ་གྲོས་བསྐྱེད།
en: And formed a resolution for the pure life.

source: །ཡང་དག་སངས་རྒྱས་གསེར་ཐུབ་ལ།
en: For the completely awakened one Kanakamuni

source: །གཙུག་ལག་ཁང་བརྩིགས་དད་པ་ཡིས།
en: I built a monastery

source: །ཁྱིམ་མེད་པར་ནི་རབ་ཏུ་བྱུང་།
en: And went forth into homelessness with faith.

source: །བྲམ་ཟེའི་ཁྱེའུ་བླ་མའི་ཚེ།
en: “When I was the young brahmin Uttara,

source: །དགའ་སྐྱོང་གི་ནི་ཚིག་ཐོས་ནས། །འོད་སྲུང་རྐང་གཉིས་མཆོག་ལས་ནི།
en: Having heard Nandīpāla’s words,

source: །རབ་ཏུ་འབྱུང་བའི་བློ་བསྐྱེད་དོ།
en: I formed a resolution to go forth

source: །བྱམས་པ་དྲང་སྲོང་གྱུར་པ་ན།
en: In front of Kāśyapa, the best of humans. “When Maitreya was a ṛṣi,

source: །རྒྱལ་པོར་གྱུར་ནས་རིམ་གྲོ་བྱས།
en: I, who was a king, served him.

source: །བྱས་པ་གཟོ་བ་རྗེས་དྲན་ནས།
en: Remembering former favors,

source: །དེས་ནི་ང་ལ་སླར་མཆོད་དོ།
en: He venerated me in return.

source: །གང་ཡང་སངས་རྒྱས་བདེ་མཛད་ནས།
en: “From the Buddha Kṣemaṃkara

source: །སངས་རྒྱས་འོད་སྲུང་བར་དུ་ནི།
en: To the Buddha Kāśyapa,

source: །ངས་ནི་བདུན་ཁྲི་བདུན་སྟོང་གི །རྒྱལ་བ་རྣམས་ནི་མཆོད་པ་བྱས།
en: I venerated Seventy-seven thousand victors.

source: །གྲངས་མེད་གསུམ་པོ་ཚང་བར་ནི།
en: “Throughout the third incalculably long eon,

source: །སྔོན་ནི་བྱང་ཆུབ་སྤྱོད་པ་ན།
en: And acted for awakening,

source: །ང་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚེ།
en: “When I was the Bodhisattva,

source: །སངས་རྒྱས་མཆོག་ནི་དེ་རྣམས་མཆོད།
en: I venerated these most excellent buddhas. I was predicted to become a buddha

source: །ང་ནི་དེ་དག་ཐམས་ཅད་ཀྱིས། །འཇིག་རྟེན་མདུན་དུ་ལུང་བསྟན་ཏོ།
en: By all of them in front of beings in the world.

source: །ངས་ནི་སྔོན་བསམས་གང་ཡིན་པ། །ང་ཡི་སྨོན་ལམ་ཐམས་ཅད་རྫོགས།
en: “All the aspirations I once made Are now accomplished.

source: །ཤི་བིའི་རྒྱལ་པོར་ང་གྱུར་ཚེ།
en: “When I was King Śibi,

source: །སྦྱིན་པ་དག་ནི་ཐམས་ཅད་བཏང་།
en: I made every kind of donation.

source: །ང་ནི་དུས་དཔོག་གྱུར་པའི་ཚེ།
en: When I was Velāma,

source: །སྦྱིན་པའི་ཕ་རོལ་ཕྱིན་པ་རྫོགས།
en: I accomplished the perfection of generosity.

source: །རྒྱ་མཚོའི་ཚོང་པར་གྱུར་པ་ན།
en: “When I was a merchant on the sea,

source: །ཚུལ་ཁྲིམས་ཕ་རོལ་ཕྱིན་དོན་དུ། །སྲོག་ཆགས་རྣམས་ནི་མ་བཏང་ཞིང་།
en: For the perfection of morality

source: །ངས་ནི་རང་གི་སྲོག་བཏང་ངོ་།
en: I sacrificed my own life Rather than sacrificing that of other beings.

source: །ང་སྔོན་དྲང་སྲོང་གྱུར་པ་ན།
en: “Once when I was a ṛṣi,

source: །བཟོད་པའི་ཕ་རོལ་རྫོགས་བྱའི་ཕྱིར།
en: To accomplish the perfection of patience

source: །ཡན་ལག་རྣམས་ནི་གཏུབས་པ་ཡིས།
en: I had my limbs cut off.

source: །ང་ཡི་བཟོད་པ་ཡོངས་སུ་རྫོགས།
en: Thus my patience was accomplished. “As is said in the jātaka of Kinnarī

source: །མི་མ་ཡིན་མོའི་སྐྱེས་རབས་དང་། །དེ་བཞིན་རྒྱ་མཚོ་བསྐམས་པ་དང་། །དེ་བཞིན་བདག་ནི་བདེན་དགའ་བའི།
en: And the story of the drying up the sea,

source: །བརྩོན་འགྲུས་ཕ་རོལ་ཕྱིན་པ་རྫོགས།
en: I accomplished the perfection of effort Of those who are pleased with the truths.

source: །སྨན་ཆེན་བློན་པོར་གྱུར་པ་དང་། །གནག་ལྷས་སྐྱེས་སུ་ང་གྱུར་ཚེ།
en: “When I was the minister Mahauṣadha And when I was Govinda,

source: །ཤེས་རབ་ཕ་རོལ་ཕྱིན་རྫོགས་ནས།
en: I accomplished the perfection of wisdom

source: །དེ་བཞིན་རྔ་བོ་ཆེ་ཡང་བསྒྲགས།
en: And achieved fame.

source: །བྲམ་ཟེ་རབ་འབར་གྱུར་པ་ན།
en: “When I was the brahmin Jājvalin,

source: །རལ་པར་འདབ་ཆགས་ཚང་བཅས་ཀྱང་།
en: Birds made a nest in my locks of hair.

source: །བསམ་གཏན་ལས་ནི་མ་ལངས་པར།
en: Not arising from my dhyāna,

source: །བསམ་གཏན་ཕ་རོལ་ཕྱིན་བརྩོན་བྱས།
en: I exerted myself in the perfection of dhyāna.

source: །སྙིང་རྗེ་ཡོངས་སུ་བསྒོམས་བྱས་ཤིང་།
en: “Practicing mercy,

source: །ཕ་རོལ་ཕྱིན་པ་དྲུག་རྫོགས་པས།
en: I accomplished the six perfections.

source: །ཁུར་ལྕི་བ་ནི་ངས་བོར་ཏེ།
en: I relieved burdens

source: །དམ་བཅས་པ་ཡང་རྫོགས་པར་བྱས།
en: And fulfilled my promise.

source: །ང་དང་སངས་རྒྱས་གང་ཕྲད་ནས།
en: “After meeting me and being venerated by me,

source: །མཆོད་པ་བྱས་པའི་མི་མཆོག་ནི།
en: The buddhas, the best of humans,

source: །དེ་ཀུན་མྱ་ངན་འདས་པར་གཤེགས།
en: All went to nirvāṇa.

source: །ང་ནི་བྱང་ཆུབ་ལ་བཞག་གོ།
en: I was established in awakening.

source: །རྒྱལ་པོ་འོད་ལྡན་དབང་པོ་ནས།
en: “Between the powerful king Prabhāsa

source: །སེམས་ཅན་བྱེ་བ་ཕྲག་སྟོང་ནི།
en: Ten billion beings were saved

source: །སྲིད་པའི་མཚོ་ལས་བསྒྲལ་བ་བྱས།
en: From the ocean of existence.

source: །འཇིག་རྟེན་གཙོ་བོ་རྣམ་འདྲེན་པ།
en: “Needless to say, I, the leader of the lords of the world,

source: །རྫོགས་སངས་རྒྱས་ཏེ་ལྷ་མིར་བཅས། །འཇིག་རྟེན་འདི་ནི་བསྒྲལ་བ་དང་། །སྒྲོལ་བར་མཛད་པ་སྨོས་ཅི་དགོས།
en: After being perfectly awakened, Saved and liberated beings in this world With its gods and humans.

source: །ངས་ནི་འཇིག་རྟེན་དོན་གྱི་ཕྱིར།
en: “For the world,

source: །མྱ་ངན་འདས་ནའང་ཆོས་ཀྱི་གྲུ། །བརྟན་པ་དག་ནི་བཅའ་བྱས་ཏེ།
en: Even after my nirvāṇa, I will prepare the sturdy ship of the Dharma

source: །བརྒྱ་སྟོང་ཕྲག་ནི་བསྒྲལ་བར་བྱ།
en: And save hundreds of thousands of beings.

source: །མི་གང་སངས་རྒྱས་སྐྱབས་སོང་ཞིང་།
en: “A person who, seeking refuge in the Buddha, Performs a service for the Buddha,

source: །མྱ་ངན་འདས་ཀྱང་སངས་རྒྱས་ལ། །བྱ་བ་བྱེད་པའི་སྐྱེས་བུ་དེ།
en: Even after the nirvāṇa—

source: །འཇིག་རྟེན་དག་ནི་སྐྱིད་དེ་བ།
en: People in the world are pleased with such a person. “If one performs even a subtle service

source: །གང་དག་དེ་བཞིན་གཤེགས་རྒྱལ་ལ། །བྱ་བ་ཅུང་ཟད་བྱེད་ནའང་དེ།
en: For the Tathāgata, the Victor,

source: །མཐོ་རིས་སྣ་ཚོགས་བགྲོད་ནས་ནི།
en: After having dwelt in various heavens,

source: །བདུད་རྩིའི་གོ་འཕང་འཐོབ་པར་འགྱུར།
en: That one will attain the state of immortality.

source: །ཡང་དག་ཇི་བཞིན་འདི་ཐོས་ནས།
en: “Those who rightly and truly hear this

source: །དགེ་བ་བུངས་ནི་བསྐྱེད་དེ་བྱ།
en: Will accumulate good deeds.

source: །ང་ནི་མྱ་ངན་འདས་འོག་ཏུ།
en: After my nirvāṇa,

source: །སྲིད་པའི་རྒྱ་མཚོར་འཁྱམས་ས་རེ།
en: Do not wander in the ocean of existence!”

source: །སངས་རྒྱས་མང་པོའི་སྐབས་རྫོགས་སོ།། །།སངས་རྒྱས་འོད་ལྡན་དང་། ཤཱཀྱ་ཐུབ་པ་དང་། ཀཽཎྜི་ནྱ་དང་། འཇིག་རྟེན་འདྲེན་དང་། གཞན་གྱིས་མི་ཐུབ་དང་། རིན་ཆེན་གཙུག་ཏོར་དང་། བདེ་མཛད་དང་། སྒྲ་སྙན་དང་། དཔལ་འབྱུང་དང་། ཕན་བཞེད་དང་། ཀཽཎྜི་ནྱ་དང་། བལྟ་ན་སྡུག་དང་། སྤྱན་མཛེས་དང་། ཡུལ་འཁོར་སྐྱོང་དང་། མར་མེ་མཛད་དང་། དཀའ་ཐུབ་མཛད་དང་། མུན་སེལ་དང་། བདེ་མཛད་དང་། དབང་ཆེན་དང་། གཙུག་ཏོར་ཅན་དང་། མ་འགགས་པ་དང་། སྤྱན་མཛེས་དང་། ལེགས་འཁྲུངས་དང་། ཡིད་བཟངས་དང་། ཙན་དན་དང་། ཚངས་སྦྱིན་དང་། འོད་ཟེར་ཅན་དང་། དོན་དམ་གཟིགས་དང་། ཤཱཀྱ་ཐུབ་པ་དང་། མཐོར་འཕགས་དང་། དམ་པ་དང་། གཙོ་བོ་དང་། དགྲ་ཞི་མཛད་དང་། ཤིང་རྟའི་ཡན་ལག་དང་། སྐལ་ལྡན་ཤིང་རྟ་དང་། ཚངས་པ་དང་། ཚངས་པའི་ཚེ་དང་། ཙན་དན་དང་། དབང་པོ་དང་། དབང་པོ་དུལ་དང་། རིན་ཆེན་རི་བོ་དང་། དོན་ཐམས་ཅད་སྒྲུབ་པ་དང་། ཐ་མ་དབང་པོའི་རྒྱལ་མཚན་དང་། བཟོད་པ་མཛད་དང་། རྫོགས་ལྡན་དང་། ཐམས་ཅད་ཟིལ་གནོན་དང་། རིན་ཆེན་གཙུག་ཕུད་དང་། པད་མ་དམ་པ་དང་། གྲགས་པ་དམ་པ་དང་། གསུང་སྙན་དང་། དྲི་མ་མེད་དང་། སད་མཛད་དང་། དགྲ་ཐུལ་དང་། གནས་འཇོག་དང་། སྐར་འོད་དང་། ཏོག་དང་། དྲང་སྲོང་དང་། བྷ་ར་དྭ་ཛ་དང་། དོན་གཟིགས་དང་། དོན་དམ་གཟིགས་དང་། དོན་ཐམས་ཅད་གཟིགས་དང་། རྒྱལ་དང་། སྐར་རྒྱལ་དང་། རྣམ་པར་གཟིགས་དང་། གཙུག་ཏོར་ཅན་དང་། ཐམས་ཅད་སྐྱོབ་དང་། ལོག་པར་དད་སེལ་དང་། གསེར་ཐུབ་དང་། འོད་སྲུང་དང་། ཤཱཀྱ་ཐུབ་པ་དང་། ཐ་མ་བྱམས་པའོ།
en: The Section of Many Buddhas is completed. The Buddha Prabhāsa, Śākyamuni, Kauṇḍinya, the leader of the world, Aparājita, Ratnaśikhin, Kṣemaṃkara, Praṇāda, Śrīsaṃbhava, Hiteṣin, Kauṇḍinya, Sudarśana, Sunetra, Dhṛtarāṣṭra, Dīpaṃkara, Ascetic Practitioner, Tamonuda, Kṣemaṃkara, Mahendra, Śikhin, Aniruddha, Sunetra, Sujāta, Sumanas, Candana, Brahmadatta, Marīcin, Parārthadarśin, Śākyamuni, Atyuccagāmin, Uttara, Śreṣṭhin, Śamitāri, Aṅgaratha, Bhāgīratha, Brahmā, Brahmāyus, Candana, Indra, Indradamana, Ratnaśaila, Sarvārtha­siddha, Indradhvaja who is the last of the second incalculably long eon, Kṣemaṃkara, Pūrṇa, Sarvābhibhū, Ratnacūḍa, Padmottara, Yaśottara, Suvādin, Vimala, Prabodhana, Jitāri, Vāsiṣṭha, Jyotiṣprabha, Ketu, Ṛṣi Bhāradvāja, Arthadarśin, Parārthadarśin, Sarvārthadarśin, Tiṣya, Puṣya, Vipaśyin, Śikhin, Viśvabhū, Krakucchanda, Kanakamuni, Kāśyapa, Śākyamuni, and Maitreya, who is the last.

source: །སངས་རྒྱས་ཀྱི་མཚན་རྣམས་རྫོགས་སྷོ།། །།སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་བཀུར་སྟི་བྱས།
en: The names of the buddhas are completed. M.

source: བླ་མར་བྱས་ཞེས་བྱ་བ་གོང་མ་བཞིན་དུ་སྟེ།
en: The Insult by the Brahmin Girl Cañcā

source: དེ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་བཞུགས་སོ།
en: The Buddha, the Blessed One, was staying in the Jetavana, in the Park of Anāthapiṇḍada near Śrāvastī.

source: །དེའི་ཚེ་གཞན་མུ་སྟེགས་ཅན་ཀུན་ཏུ་རྒྱུ་རབ་ཏུ་མང་པོ་རྟོག་ཁང་དུ་ལྷགས་ཤིང་འདུས་པར་གྱུར་ནས་སྐབས་ཀྱི་གཏམ་འདི་ལྟ་བུ་དག་གླེང་བར་བྱེད་དེ།
en: He was treated with honor, looked up to . . . . At that time, many wandering mendicants belonging to a different faith sat together in a meeting hall and talked with each other:

source: ཤེས་ལྡན་དག་ཤེས་པར་གྱིས་ཤིག །སྔོན་ནི་བདག་ཅག་ལ་རྒྱལ་པོ་དང་། བློན་པོ་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་དང་། གྲོང་མི་དང་། ཡུལ་མི་དང་། ཚོང་པ་དང་། ཚོང་དཔོན་དང་། དེད་དཔོན་རྣམས་ཀྱིས་བཀུར་སྟི་བྱས། བླ་མར་བྱས།
en: “Sirs, please understand that once we were treated with honor, looked up to, and esteemed by kings, ministers, brahmins, householders, citizens, provincial dwellers, merchants, the heads of guilds, and caravan leaders.

source: རྗེད་པར་བྱས་པས་གོས་དང་། བསོད་སྙོམས་དང་། གནས་མལ་དང་། ནད་ཀྱི་རྐྱེན་སྨན་གྱི་ཡོ་བྱད་རྣམས་ཀྱང་རྙེད་པ་ལས།
en: Thus, the requisites were obtained for us, too, namely, robes, almsfood, bedding, and medicines for the sick.

source: ད་ནི་དགེ་སྦྱོང་གཽ་ཏ་མ་འཇིག་རྟེན་དུ་བྱུང་བ་ལ་བཀུར་སྟི་བྱེད། བླ་མར་བྱེད། རྗེད་པར་བྱེད། མཆོད་པར་བྱེད་ཅེས་བྱ་བ་ནས་སྨན་དང་ཡོ་བྱད་རྣམས་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་ནོ།
en: Now, however, they treat with honor, look up to, esteem, and venerate the śramaṇa Gautama who has appeared in the world, and the requisites are obtained only for him, namely . . . medicines for the sick.

source: །དེས་ན་ད་ལྟར་བདག་ཅག་གི་རྙེད་པ་དང་བཀུར་སྟི་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་ཆད་ན།
en: Because of this, our gain and honor have now been completely lost.

source: དེ་ལ་ད་བདག་ཅག་གིས་ཇི་ལྟར་བྱ། དེ་ནས་ཁ་ཅིག་གིས་སྨྲས་པ།
en: What should we do about this?” Then someone suggested, “Sexual intercourse is a fault for those who lead the pure life.

source: ཚངས་པར་སྤྱོད་པ་ལ་མི་ཚངས་པར་སྤྱོད་པ་སྐྱོན་ཡིན་པས་དེ་ལ་སྐྱོན་འདི་གདགས་སོ།
en: So, let us lay this fault on him.”

source: །ཁ་ཅིག་གིས་སྨྲས་པ། ཇི་ལྟ་བུ་ཞིག་བྱ། དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: “How should we do that?” asked another.

source: བདག་ཅག་གི་ནང་ན་ཀུན་དུ་རྒྱུ་གཟུགས་བཟང་མོ་མཛེས་པ་བལྟ་ན་སྡུག་པ་གང་ཡིན་པ་དེ་ལ་སྲིང་མོ་དག་ཚུར་དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་སྐུར་པ་ཐོབ་ཅིག་ཅེས་སྤྲོ་བར་བྱའོ།
en: They then decided, “We should entice a female mendicant among us who is well proportioned, attractive, and pleasant to behold: ‘Sister, now slander the śramaṇa Gautama.’ ”

source: །བདག་ཅག་གི་ནང་ན་ཀུན་ཏུ་རྒྱུ་གཟུགས་བཟང་མོ་མཛེས་པ་བལྟ་ན་སྡུག་པ་གང་ཡིན།
en: “Which female mendicant among us is well proportioned, attractive, and pleasant to behold?”

source: བྲམ་ཟེའི་བུ་མོ་རྩྭ་མི་ཡིན་ནོ། །དེ་ལ་སྤྲོ་བ་བསྐྱེད་དོ་ཞེས་དེ་རྣམས་ཀྱིས་དེ་ཕོ་ཉས་བཀུག་སྟེ་སྨྲས་པ།
en: “The brahmin girl Cañcā is. Let us entice her.”

source: སྲིང་མོ་ཤེས་པར་གྱིས་ཤིག །སྔོན་ནི་བདག་ཅག་གིས་བཀུར་སྟི་དང་ཞེས་བྱ་བ་ནས་ནད་ཀྱི་རྐྱེན་སྨན་གྱི་ཡོ་བྱད་རྣམས་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: They summoned her by messenger and said, “Sister, understand that once we were treated with honor . . . . The requisites were obtained for us, namely, . . . medicines for the sick.

source: །ད་ནི་དགེ་སྦྱོང་གཽ་ཏ་མ་འཇིག་རྟེན་དུ་བྱུང་བས་འཇིག་རྟེན་དེ་ལ་བཀུར་སྟི་བྱེད་པས་བདག་ཅག་གི་རྙེད་པ་དང་བཀུར་སྟི་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་ཆད་པར་གྱུར་ན།
en: However, since the śramaṇa Gautama appeared in the world, people treat him with honor, and our gain and honor have now been completely lost.

source: ཁྱོད་ཀྱིས་ཡལ་བར་དོར་རམ།
en: Are you going to ignore this?”

source: བྲམ་ཟེའི་བུ་མོ་ཀུན་ཏུ་རྒྱུ་རྩྭ་མིས་སྨྲས་པ། འཕགས་པ་དག་བདག་གིས་དེ་ལ་ཇི་ལྟར་བགྱི་ལགས།
en: “Noble ones, what should I do about that?” asked the brahmin girl, the female mendicant Cañcā.
